In [2]:
import numpy as np
import pandas as pd

In [3]:
np.nan

nan

In [5]:
pd.NA

In [6]:
pd.NaT  # Indica que la data faltante debe ser un 'timesptamp'

NaT

In [7]:
np.nan == np.nan ## False, porque no se sabe que valor es, por lo tanto no se puede decir que el valor es igual

False

In [8]:
np.nan is np.nan  # True, porque en este caso si sabe que es un 'not a number'

True

In [9]:
myvar = np.nan
myvar is np.nan

True

In [11]:
df = pd.read_csv('movie_scores.csv')
df.head()

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [12]:
df.isnull() # ? Devuelve true, si algun valor esta vacio

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [13]:
df.notnull() # ? Devuelve true, si los valores NO estan vacios

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [15]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [14]:
df['pre_movie_score'].notnull()

0     True
1    False
2    False
3     True
4     True
Name: pre_movie_score, dtype: bool

In [17]:
df[df['pre_movie_score'].notnull()]  # ? Devuelve los valores de 'pre_movie_score' que SI tengan valores

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [19]:
df[df['pre_movie_score'].isnull()]  # ? Devuelve las filas que contengan un NaN en "pre_movie_score"

  first_name last_name   age  sex  pre_movie_score  post_movie_score
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN